[
  {
    "topic": "Debugging a server that can't reach the internet",
    "category": "Networking",
    "answer": "<p>A server can ping its gateway but not any external IPs. Explain the full troubleshooting chain: check default route using <code>ip route</code>, verify DNS using <code>dig</code> or <code>nslookup</code>, inspect firewall/NAT on the router, confirm no asymmetric routing, and verify ISP reachability. Include explanations of routing tables, gateway logic, ICMP filtering, and why traceroute reveals more than ping.</p>"
  },
  {
    "topic": "Deep explanation of SSH handshake internals",
    "category": "Security",
    "answer": "<p>Explain step-by-step what happens during an SSH connection: TCP 3-way handshake, SSH protocol negotiation, key exchange (Diffie-Hellman/ECDH), server host key verification, creation of symmetric session keys, and user authentication. Clarify the difference between host keys vs user keys, and why MITM attacks target the key exchange phase.</p>"
  },
  {
    "topic": "Explain what happens when you run 'curl -v https://example.com'",
    "category": "Networking",
    "answer": "<p>Break down DNS resolution, TCP handshake, TLS handshake, ALPN negotiation, server certificate validation, HTTP request construction, response parsing, and how <code>-v</code> exposes headers and TLS debug info. Explain SNI and why <code>Host:</code> is required in HTTP/1.1.</p>"
  },
  {
    "topic": "How Linux actually boots (deep dive)",
    "category": "System Administration",
    "answer": "<p>Explain BIOS/UEFI initialization, the bootloader (GRUB), kernel loading, initramfs, systemd target selection, and how services become processes. Include what happens when a required unit fails and how emergency mode works.</p>"
  },
  {
    "topic": "Explain ARP and why ARP failures break LAN communication",
    "category": "Networking",
    "answer": "<p>Describe how ARP resolves IP → MAC, ARP cache behavior (<code>ip neigh</code>), ARP poisoning attacks, and how switches behave with unknown unicast traffic. Include real-world scenarios where ARP breaks: duplicate IPs, outdated cache, gateway MAC changes.</p>"
  },
  {
    "topic": "Deep explanation of 'tcpdump -i eth0 port 443'",
    "category": "Networking Tools",
    "answer": "<p>Explain packet capturing at Layer 2, kernel BPF filters, why capturing cannot decrypt TLS, how SYN/SYN-ACK/ACK patterns reveal connection success, and why retransmissions show packet loss. Explain <code>-i</code>, <code>port</code>, and how to refine filters.</p>"
  },
  {
    "topic": "Explain how sudo actually grants privileges",
    "category": "Linux",
    "answer": "<p>Describe PAM (Pluggable Authentication Modules), sudoers policy evaluation, secure_path, timestamp files, and why misconfigured sudoers can allow privilege escalation. Include explanation of <code>sudo -l</code> enumeration.</p>"
  },
  {
    "topic": "Explain CSRF protection deeply",
    "category": "Security",
    "answer": "<p>Explain the real mechanics of CSRF: browser auto-sending cookies, the SameSite attribute, token generation, double-submit cookie pattern, and why GET should never trigger state changes. Include typical failures in real apps.</p>"
  },
  {
    "topic": "Explain what happens when you run 'systemctl restart nginx'",
    "category": "System Administration",
    "answer": "<p>Explain how systemd sends signals, tracks PIDs in cgroups, reloads configuration, handles unit dependencies, and logs to the journal. Describe race conditions, ExecStartPre checks, and why reload may be safer than restart in production.</p>"
  },
  {
    "topic": "Explain SQL injection deeply with examples",
    "category": "Security",
    "answer": "<p>Break down query parsing, how malicious input alters AST, why parameterized queries work, stored procedure pitfalls, prepared statement caching, and real-world exploitation chains (data extraction → privilege escalation → lateral movement).</p>"
  }
]
